app/controllers/products_controller.rb

  def index
    @categories = Category.all(:include => :products)
---
SELECT `products`.* FROM `products`