app/views/products/index.haml

SELECT `products`.* FROM `products`
---
    .row
      - category.products.each do |product|
        .col-md-5.product